In [1]:
import pandas as pd

In [160]:
df = pd.read_html('https://sos.ga.gov/elections/election_results/2010_0720/0124002.htm')

In [161]:
df = df[2]

In [162]:
df.shape

(9, 6)

In [163]:
df.head(5)

          0     1              2              3   4   5
0       NaN   NaN  Currie  3,604  Totals  3,604 NaN NaN
1       NaN   NaN         100.0%         100.0% NaN NaN
2    County   PPR            NaN            NaN NaN NaN
3     BACON  100%            154            154 NaN NaN
4  BRANTLEY  100%            487            487 NaN NaN

In [164]:
df = df[3:]

In [165]:
df.head(5)

          0     1    2    3   4   5
3     BACON  100%  154  154 NaN NaN
4  BRANTLEY  100%  487  487 NaN NaN
5  CHARLTON  100%  255  255 NaN NaN
6    COFFEE  100%  746  746 NaN NaN
7    PIERCE  100%  196  196 NaN NaN

In [166]:
df = df[df.columns[[0,2]]]

In [167]:
df.head(5)

          0    2
3     BACON  154
4  BRANTLEY  487
5  CHARLTON  255
6    COFFEE  746
7    PIERCE  196

In [168]:
df.columns = ['county', 'Richard Currie']

In [169]:
df.tail(5)

     county Richard Currie
4  BRANTLEY            487
5  CHARLTON            255
6    COFFEE            746
7    PIERCE            196
8      WARE           1766

In [170]:
df = df.melt(id_vars=['county'])

In [171]:
df.columns = ['county', 'candidate', 'votes']

In [172]:
df.head()

     county       candidate votes
0     BACON  Richard Currie   154
1  BRANTLEY  Richard Currie   487
2  CHARLTON  Richard Currie   255
3    COFFEE  Richard Currie   746
4    PIERCE  Richard Currie   196

In [173]:
df['votes'] = df['votes'].astype(int)

In [174]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
county       6 non-null object
candidate    6 non-null object
votes        6 non-null int64
dtypes: int64(1), object(2)
memory usage: 272.0+ bytes

In [175]:
df['office'] = 'District Attorney'

In [176]:
df['district'] = 'Waycross Circuit'

In [177]:
df['party'] = 'Democrat'
# df['party'] = 'Republican'

In [178]:
df.groupby(['candidate', 'party'])['votes'].sum()

candidate       party
Richard Currie  Democrat    3604
Name: votes, dtype: int64

In [179]:
df[['county', 'office', 'district', 'party', 'candidate', 'votes']].head()

,county,office,district,party,candidate,votes
0,BACON,District Attorney,Waycross Circuit,Democrat,Richard Currie,154
1,BRANTLEY,District Attorney,Waycross Circuit,Democrat,Richard Currie,487
2,CHARLTON,District Attorney,Waycross Circuit,Democrat,Richard Currie,255
3,COFFEE,District Attorney,Waycross Circuit,Democrat,Richard Currie,746
4,PIERCE,District Attorney,Waycross Circuit,Democrat,Richard Currie,196

In [180]:
df[['county', 'office', 'district', 'party', 'candidate', 'votes']].to_clipboard(index=False, sep=',')